Repository: LittleGD/UpNext
Catalog: upnext-ios/UpNext/UpNext/Localizable.xcstrings
Source language: ko
Languages: en, ja, zh_hans

source: (나)
en: (me)
ja: (私)
zh_hans: (我)

source: %.1fs 남음
en: %.1fs left
ja: 残り %.1fs
zh_hans: 剩余 %.1fs

source: %.2fs (목표 %.1fs)
en: %.2fs (target %.1fs)
ja: %.2fs (目標 %.1fs)
zh_hans: %.2fs (目标 %.1fs)

source: %@ — 버릴까요?
en: Discard %@?
ja: %@ を捨てますか？
zh_hans: 丢弃 %@?

source: %@ — 카드 고르기
en: %@ — Pick a Card
ja: %@ — カードを選ぶ
zh_hans: %@ — 选择卡牌

source: %@ — 판매할까요?
en: Sell %@?
ja: %@ を売却しますか？
zh_hans: 出售 %@?

source: %@ 강화 (+%lld → +%lld)?
en: Enhance %@ (+%lld → +%lld)?
ja: %@ 強化 (+%lld → +%lld)？
zh_hans: 强化 %@ (+%lld → +%lld)?

source: %@ 구매 · 보유 %lld
en: %@ bought · you now have %lld
ja: %@ を購入 · 所持 %lld
zh_hans: 购买%@ · 持有 %lld

source: %@ 모드는 내일부터 적용됩니다.
en: %@ mode takes effect tomorrow.
ja: %@モードは明日から適用されます。
zh_hans: %@模式将于明天生效。

source: %@ 방패로 메움
en: %@ filled with Shield
ja: %@ シールドで補填
zh_hans: %@ 用护盾填补

source: %@ 불꽃 켜짐
en: %@ Flame lit
ja: %@ 炎がついた
zh_hans: %@ 火焰已点燃

source: %@ 빈 날
en: %@ empty day
ja: %@ 空白の日
zh_hans: %@ 空白日

source: %@ 쓰기 (보유 %lld)
en: Use %@ (you have %lld)
ja: %@ を使う (所持 %lld)
zh_hans: 使用%@ (持有 %lld)

source: %@ 없음 · 보스와 탐험 상자에서 나와요
en: No %@ · they drop from bosses and dungeon chests
ja: %@ がありません · ボスと探索の宝箱から出ます
zh_hans: 没有%@ · 击败首领和探索宝箱可获得

source: %@ 없음 · 상점에서 살 수 있어요
en: No %@ · you can buy one at the shop
ja: %@ がありません · 商店で買えます
zh_hans: 没有%@ · 可在商店购买

source: %@ 완료!
en: %@ complete!
ja: %@完了！
zh_hans: %@完成！

source: %@ 주간
en: Week of %@
ja: %@ の週
zh_hans: %@ 周

source: %@ 카드 %lld회 완료
en: Completed %@ cards %lld times
ja: %@カードを%lld回完了
zh_hans: 完成%@卡牌%lld次

source: %@ 탐험권 +1
en: %@ Explore Ticket +1
ja: %@探索チケット +1
zh_hans: %@探索券 +1

source: %@ 탐험권 구매 (%lld 코인)
en: Buy %@ Explore Ticket (%lld coins)
ja: %@探索チケットを購入 (%lldコイン)
zh_hans: 购买%@探索券 (%lld金币)

source: %@ 특화
en: %@ Specialization
ja: %@特化
zh_hans: %@专精

source: %@ 팩
en: %@ Pack
ja: %@パック
zh_hans: %@卡包

source: %@님은 아직이에요
en: %@ hasn't lit theirs yet
ja: %@さんはまだです
zh_hans: %@还没点燃

source: %lld / %lld 선택
en: %lld / %lld selected
ja: %lld / %lld 選択
zh_hans: 已选 %lld / %lld

source: %lld / %lld 찾음 · %@
en: %lld / %lld found · %@
ja: %lld / %lld 発見 · %@
zh_hans: 已找到 %lld / %lld · %@

source: %lld / %lld종 발견
en: %lld / %lld discovered
ja: %lld / %lld 種発見
zh_hans: 已发现 %lld / %lld 种

source: %lld 코인 / 장 · 하루 %lld장 한정
en: %lld coins each · %lld per day
ja: %lld コイン/枚 · 1日 %lld枚限定
zh_hans: %lld 金币/张 · 每日 %lld 张限购

source: %lld 코인으로 +%lld → +%lld 강화해요. +5·+10 에서 부적 스킬을 얻어요.
en: Spend %lld coins to enhance +%lld → +%lld. You get a talisman skill at +5 and +10.
ja: %lldコインで +%lld → +%lld に強化します。+5・+10 でお守りスキルを獲得します。
zh_hans: 用 %lld 金币把 +%lld → +%lld 强化。在 +5·+10 时获得护符技能。

source: %lld 코인을 써서 이 사진을 부적으로 만들어요. 등급은 무작위예요.
en: Spend %lld coins to turn this photo into a talisman. The grade is random.
ja: %lldコインを使ってこの写真をお守りにします。等級はランダムです。
zh_hans: 花 %lld 金币把这张照片做成护符。等级是随机的。

source: %lldms — 성공!
en: %lldms — Success!
ja: %lldms — 成功！
zh_hans: %lldms — 成功！

source: %llds 남음
en: %llds left
ja: 残り%lld秒
zh_hans: 剩余%llds

source: %lld개
en: %lld
ja: %lld個
zh_hans: %lld个

source: %lld단계
en: Tier %lld
ja: %lld段階
zh_hans: 第%lld阶

source: %lld단계 · Lv.%lld · SP %lld
en: Tier %lld · Lv.%lld · SP %lld
ja: %lld段階 · Lv.%lld · SP %lld
zh_hans: 第%lld阶 · Lv.%lld · SP %lld

source: %lld번째 응원이 도착했어요
en: Cheer #%lld has arrived
ja: %lld回目の応援が届きました
zh_hans: 第 %lld 次应援已送达

source: %lld분
en: %lld min
ja: %lld分
zh_hans: %lld 分钟

source: %lld시간
en: %lld h
ja: %lld時間
zh_hans: %lld 小时

source: %lld시간 %lld분
en: %lld h %lld min
ja: %lld時間 %lld分
zh_hans: %lld 小时 %lld 分钟

source: %lld일
en: %lld days
ja: %lld日
zh_hans: %lld天

source: %lld일 연속 실천가
en: %lld-Day Streak Keeper
ja: %lld日連続の実践者
zh_hans: 连续%lld天实践者

# %lld일 체크인 · 카드 %lld장 · 로그 %lld개
source: %1$lld일 체크인 · 카드 %2$lld장 · 로그 %3$lld개
en: %lld-day check-in · %lld cards · %lld logs
ja: %lld日チェックイン・カード%lld枚・ログ%lld件
zh_hans: %lld天签到 · %lld张卡牌 · %lld条记录

# %lld일째 · 세이버 %lld개
source: %1$lld일째 · 세이버 %2$lld개
en: Day %lld · %lld Shields
ja: %lld日目・シールド%lld個
zh_hans: 第%lld天 · %lld个护盾

source: %lld일째 진행 중 — 백업이 안 되어 있어요
en: Day %lld and going strong, but your progress isn't backed up
ja: %lld日目、でもまだバックアップされていません
zh_hans: 已坚持第%lld天，但进度还没备份哦

source: %lld장
en: %lld cards
ja: %lld枚
zh_hans: %lld张

# %lld장 로드 · 스타터 %lld
source: %1$lld장 로드 · 스타터 %2$lld
en: %lld cards loaded · Starter %lld
ja: %lld枚ロード・スターター%lld
zh_hans: 已加载%lld张 · 初始%lld

source: %lld장 선택 완료
en: %lld cards selected
ja: %lld枚 選択完了
zh_hans: 已选好 %lld 张

source: %lld장/일
en: %lld/day
ja: %lld枚/日
zh_hans: %lld张/天

source: %lld장의 카드를 모두 모았어요. 진정한 갓생러의 길에 한 발 더 다가섰습니다.
en: You've collected all %lld cards. You're one step closer to the true go-getter life.
ja: %lld枚のカードをすべて集めました。 本物の理想の毎日への道に一歩近づきました。
zh_hans: 你已集齐全部%lld张卡牌。 离真正的充实生活又近了一步。

source: %lld종
en: %lld types
ja: %lld種
zh_hans: %lld种

source: %lld층
en: Floor %lld
ja: %lld階
zh_hans: 第%lld层

source: %lld코인이 도착했어요. 첫 리롤에 쓸 수 있어요.
en: %lld coins have arrived. Use them on your first reroll.
ja: %lldコインが届きました。最初のリロールに使えます。
zh_hans: %lld金币已到账，可用于第一次重抽。

source: '%@' 을(를) 완료로 표시할까요?
en: Mark '%@' as complete?
ja: 「%@」を完了にしますか？
zh_hans: 将「%@」标记为完成吗？

source: +%lld 코인
en: +%lld coins
ja: +%lld コイン
zh_hans: +%lld 金币

source: +2장 도전 · 보너스 XP
en: +2 cards · Bonus XP
ja: +2枚チャレンジ · ボーナスXP
zh_hans: +2张挑战 · 奖励XP

source: +3장 도전 · 칭호 보상
en: +3 cards · Title reward
ja: +3枚チャレンジ · 称号報酬
zh_hans: +3张挑战 · 称号奖励

source: 1. 개요
en: 1. Overview
ja: 1. 概要
zh_hans: 1. 概述

source: 100일 달성 — 전설의 불꽃
en: 100 Days Reached — Legendary Flame
ja: 100日達成 — 伝説の炎
zh_hans: 达成100天 — 传说之火焰

source: 1× / 2× / 4× 로 진행 속도를 조정. 가운데 버튼으로 잠시 멈출 수 있어요.
en: Adjust the speed with 1× / 2× / 4×. Use the center button to pause for a moment.
ja: 1× / 2× / 4× で進行スピードを調整。真ん中のボタンで少しの間止められます。
zh_hans: 用 1× / 2× / 4× 调整推进速度。点中间的按钮可以暂停一会儿。

source: 2 round 공격 2배
en: Attack twice per turn for 2 rounds.
ja: 2 ターン攻撃 2倍
zh_hans: 2 回合攻击 ×2

source: 2 round 회피 100%.
en: 100% dodge for 2 rounds.
ja: 2ターン回避100%。
zh_hans: 2 回合闪避 100%。

source: 2. 수집하는 데이터
en: 2. Data We Collect
ja: 2. 収集するデータ
zh_hans: 2. 收集的数据

source: 2배로 받았어요
en: Received 2x
ja: 2倍で受け取りました
zh_hans: 已领取双倍

source: 2인 불꽃
en: Two-Player Flame
ja: 2人の炎
zh_hans: 双人火焰

source: 2인 불꽃은 로그인이 필요해요
en: Two-Player Flame requires login
ja: 2人の炎はログインが必要です
zh_hans: 双人火焰需要登录

source: 2인 불꽃이 시작됐어요
en: Your duo Flame has started
ja: 2人の炎が灯りました
zh_hans: 双人火焰已开启

source: 2초 로그 남기기
en: Leave a 2-Second Log
ja: 2秒ログを残す
zh_hans: 留下2秒记录

source: 3 round 공격 +25%
en: Attack +25% for 3 rounds.
ja: 3 ターン攻撃 +25%
zh_hans: 3 回合攻击 +25%

source: 3 round 동안 공격 +30%.
en: Attack +30% for 3 rounds.
ja: 3ターンの間、攻撃+30%。
zh_hans: 3 回合内攻击 +30%。

source: 3 round 무적.
en: Invulnerable for 3 rounds.
ja: 3ターン無敵。
zh_hans: 3 回合无敌。

source: 3. 데이터 이용 목적
en: 3. How We Use Data
ja: 3. データの利用目的
zh_hans: 3. 数据用途

source: 3라운드 메모리 매치로 카드를 모아요
en: Collect cards in a 3-round memory match
ja: 3ラウンドのメモリーマッチでカードを集めよう
zh_hans: 用3轮记忆配对收集卡牌

source: 3연속 매치 시 기회 +1 (라운드 1회)
en: +1 chance on a 3-match streak (once per round)
ja: 3連続マッチでチャンス+1（ラウンド1回）
zh_hans: 3连续配对时机会+1（每回合1次）

source: 4. 제3자 제공
en: 4. Third-Party Sharing
ja: 4. 第三者への提供
zh_hans: 4. 第三方共享

source: 5. 데이터 삭제와 광고 설정
en: 5. Data Deletion and Ad Settings
ja: 5. データの削除と広告設定
zh_hans: 5. 数据删除与广告设置

source: 6. 문의
en: 6. Contact
ja: 6. お問い合わせ
zh_hans: 6. 联系方式

source: Apple ID 로그인이 필요해요
en: Apple ID sign-in required
ja: Apple IDでのサインインが必要です
zh_hans: 需要使用 Apple ID 登录

source: Apple ID 응답을 확인할 수 없어요
en: Couldn't verify the Apple ID response
ja: Apple IDの応答を確認できませんでした
zh_hans: 无法验证 Apple ID 的响应

source: Apple 로그인 중 오류가 발생했어요
en: Something went wrong during Apple sign-in
ja: Appleサインイン中にエラーが発生しました
zh_hans: Apple 登录时出错了

source: Apple 로그인을 처리할 수 없어요 — 잠시 후 다시 시도해주세요
en: Couldn't process Apple sign-in — please try again in a moment
ja: Appleサインインを処理できませんでした — しばらくしてからもう一度お試しください
zh_hans: 无法处理 Apple 登录 — 请稍后再试

source: Apple 로그인이 실패했어요 — 다시 시도해주세요
en: Apple sign-in failed — please try again
ja: Appleサインインに失敗しました — もう一度お試しください
zh_hans: Apple 登录失败 — 请再试一次

source: Apple로 계속하기
en: Continue with Apple
ja: Appleで続ける
zh_hans: 通过 Apple 继续

# Back
source: 뒤로
en: Back
ja: 戻る
zh_hans: 返回

source: Body — 매일 6장의 카드를 뽑아 2개를 수행하세요
en: Body — Draw 6 cards every day and complete 2 of them
ja: Body — 毎日6枚のカードを引いて2つをこなしましょう
zh_hans: Body — 每天抽 6 张卡牌，完成其中 2 个

source: Caption — 연속 7일 달성 중
en: Caption — On a 7-day streak
ja: Caption — 7日連続達成中
zh_hans: Caption — 已连续达成 7 天

source: Cards.json 디코드 실패
en: Failed to decode Cards.json
ja: Cards.jsonのデコードに失敗しました
zh_hans: Cards.json 解码失败

source: Display — 갓생 시작
en: Display — Start your go-getter life
ja: Display — 理想の毎日を始めよう
zh_hans: Display — 开启充实生活

source: Google로 계속하기
en: Continue with Google
ja: Googleで続ける
zh_hans: 通过 Google 继续

source: HP +15 회복.
en: Restore 15 HP.
ja: HP を 15 回復。
zh_hans: 恢复 15 点 HP。

source: HP +30 + 다음 3 round 피해 -25%.
en: HP +30 and damage taken −25% for 3 rounds.
ja: HP+30+次の3ターン被ダメージ-25%。
zh_hans: HP +30 + 接下来 3 回合受到伤害 -25%。

source: HP +40 + 다음 3 round 피해 -30%.
en: HP +40 and damage taken −30% for 3 rounds.
ja: HP+40+次の3ターン被ダメージ-30%。
zh_hans: HP +40 + 接下来 3 回合受到伤害 -30%。

source: HP +40 회복.
en: Heal HP +40.
ja: HP+40回復。
zh_hans: HP 恢复 +40。

source: HP +50 회복 + 다음 2 round 공격 +20%.
en: Heal HP +50 and attack +20% for 2 rounds.
ja: HP+50回復+次の2ターン攻撃+20%。
zh_hans: HP 恢复 +50 + 接下来 2 回合攻击 +20%。

source: HP +80 회복 + 다음 3 round 피해 -30%.
en: Heal HP +80 and damage taken −30% for 3 rounds.
ja: HP+80回復+次の3ターン被ダメージ-30%。
zh_hans: HP 恢复 +80 + 接下来 3 回合受到伤害 -30%。

source: HP 0 또는 시간 0 이면 탐험 종료. 시간은 층 이동·전투·이벤트로 소모돼요.
en: When HP hits 0 or Time hits 0, the explore ends. Time is spent on moving floors, battles, and events.
ja: HPが0または時間が0になると探索終了。時間はフロア移動・戦闘・イベントで消費します。
zh_hans: HP为0或时间为0时探索结束。时间会因层间移动、战斗和事件而消耗。

source: HP · 시간
en: HP · Time
ja: HP · 時間
zh_hans: HP · 时间

source: HP 완전 회복 + 시간 +30.
en: Fully heal HP and time +30.
ja: HP完全回復+時間+30。
zh_hans: HP 完全恢复 + 时间 +30。

source: HP 완전 회복 · 시간 +30
en: HP fully restored · time +30.
ja: HP 完全回復 · 時間 +30
zh_hans: HP 完全恢复 · 时间 +30

source: HP 완전 회복.
en: Fully heal HP.
ja: HP完全回復。
zh_hans: HP 完全恢复。

source: Heading — 카드 컬렉션
en: Heading — Card Collection
ja: Heading — カードコレクション
zh_hans: Heading — 卡牌收藏

source: Lv 별 칭호
en: Titles by Level
ja: Lvごとの称号
zh_hans: 按等级的称号

source: Lv.%lld · %lld일 완료 · %lld XP
en: Lv.%lld · %lld days done · %lld XP
ja: Lv.%lld · %lld日完了 · %lld XP
zh_hans: Lv.%lld · 完成%lld天 · %lld XP

source: Lv.%lld 기준
en: Based on Lv.%lld
ja: Lv.%lld 基準
zh_hans: 以 Lv.%lld 为准

source: Lv.%lld 해금
en: Unlocks at Lv.%lld
ja: Lv.%lld で解放
zh_hans: Lv.%lld 解锁

source: Lv.30 — 전문 클래스 선택
en: Lv.30 — Pick your specialist class
ja: Lv.30 — 専門クラスを選ぼう
zh_hans: Lv.30 — 挑选专精职业

source: Micro — 2026.05.15 업데이트
en: Micro — Updated 2026.05.15
ja: Micro — 2026.05.15 アップデート
zh_hans: Micro — 2026.05.15 更新

source: Phase 1 — 색상 46 · 타이포 6단계 · 아이콘 34
en: Phase 1 — 46 colors · 6 type scales · 34 icons
ja: Phase 1 — カラー46 · タイポ6段階 · アイコン34
zh_hans: Phase 1 — 配色 46 · 字体 6 级 · 图标 34

source: Splash 모션
en: Splash motion
ja: スプラッシュモーション
zh_hans: 启动动画

source: Title — 오늘의 챌린지
en: Title — Today's Challenge
ja: Title — 今日のチャレンジ
zh_hans: Title — 今日挑战

source: UpNext 로고 스티커
en: UpNext logo sticker
ja: UpNext ロゴステッカー
zh_hans: UpNext 标志贴纸

source: UpNext 시작하기
en: Start UpNext
ja: UpNextをはじめる
zh_hans: 开始 UpNext

source: UpNext 폴라로이드
en: UpNext Polaroid
ja: UpNext ポラロイド
zh_hans: UpNext 拍立得

source: UpNext(이하 '앱')는 사용자의 개인정보를 소중히 다룹니다. 본 방침은 앱이 어떤 데이터를 수집하고 어떻게 활용하는지 설명합니다.
en: UpNext (the 'App') values your privacy. This policy explains what data the App collects and how it is used.
ja: UpNext（以下「アプリ」）はユーザーのプライバシーを大切にしています。本ポリシーは、アプリが収集するデータとその利用方法について説明します。
zh_hans: UpNext（以下简称'应用'）重视用户的隐私。本政策说明应用收集哪些数据以及如何使用这些数据。

source: U↗Next 2.8s 시퀀스 — spring duration 0.7 bounce 0.3 을 SwiftUI response/dampingFraction 수학 변환.
en: U↗Next 2.8s sequence — spring duration 0.7 bounce 0.3 converted into SwiftUI response/dampingFraction math.
ja: U↗Next 2.8sシーケンス — spring duration 0.7 bounce 0.3をSwiftUIのresponse/dampingFraction数学に変換。
zh_hans: U↗Next 2.8s 序列 — 把 spring duration 0.7 bounce 0.3 换算成 SwiftUI 的 response/dampingFraction 数学。

# XP +%lld · 코인 +%lld
source: XP +%1$lld · 코인 +%2$lld
en: XP +%lld · Coins +%lld
ja: XP +%lld · コイン +%lld
zh_hans: XP +%lld · 金币 +%lld

source: XP +%lld · 하트 %lld
en: XP +%lld · Hearts %lld
ja: XP +%lld · ハート %lld
zh_hans: XP +%lld · 红心 %lld

source: Z게이지 아이콘
en: Gen-Z Icon
ja: Z世代アイコン
zh_hans: Z世代偶像

# ios.log.boss
source: 보스 {monster} 등장! ({floor}층)
en: Boss {monster} appears! (Floor {floor})
ja: ボス {monster} 登場！（{floor}階）
zh_hans: 首领 {monster} 登场！（第{floor}层）

# ios.log.combatCrit
source: {who}의 치명타! — {damage} 피해
en: {who} crit! — {damage} damage
ja: {who}のクリティカル！ — {damage} ダメージ
zh_hans: {who}暴击！ — {damage} 伤害

# ios.log.combatDodge
source: {who}이 회피
en: {who} dodged
ja: {who}が回避
zh_hans: {who}闪避

# ios.log.combatHit
source: {who}의 공격 — {damage} 피해
en: {who}'s attack — {damage} damage
ja: {who}の攻撃 — {damage} ダメージ
zh_hans: {who}的攻击 — {damage} 伤害

# ios.log.combatMiss
source: {who}의 공격이 빗나갔다
en: {who}'s attack missed
ja: {who}の攻撃が外れた
zh_hans: {who}的攻击落空

# ios.log.drop
source: {equipment} 획득!
en: Got {equipment}!
ja: {equipment} を獲得！
zh_hans: 获得 {equipment}！

# ios.log.encounter
source: {monster} 출현!
en: {monster} appeared!
ja: {monster} が現れた！
zh_hans: {monster} 出现了！

# ios.log.floorEnter
source: {floor}층 진입
en: Entered Floor {floor}
ja: {floor}階に進入
zh_hans: 进入第{floor}层

# ios.log.monsterEffect
source: 몬스터 효과 발동
en: Monster effect triggered
ja: モンスター効果発動
zh_hans: 怪物效果触发

# ios.log.treasureFallback
source: 보물 발견 — 코인 +{coins}
en: Treasure found — Coins +{coins}
ja: 宝物発見 — コイン +{coins}
zh_hans: 发现宝藏 — 金币 +{coins}

# ios.log.victory
source: {monster} 처치 — XP +{xp}, 코인 +{coins}
en: Defeated {monster} — XP +{xp}, Coins +{coins}
ja: {monster} を倒した — XP +{xp}、コイン +{coins}
zh_hans: 击败 {monster} — XP +{xp}，金币 +{coins}

source: shake → flash → 3-halo expand → reveal 스태거 — 등급별 강도 차등.
en: shake → flash → 3-halo expand → reveal stagger — intensity scales by rarity.
ja: shake → flash → 3-halo expand → reveal のスタッガー — レアリティごとに強度を差別化。
zh_hans: shake → flash → 3-halo expand → reveal 交错动画 — 强度按稀有度分级。

# uphero.camp.ambience.1
source: 모닥불이 조용히 타오른다
en: The campfire burns quietly.
ja: 焚き火が静かに燃えている
zh_hans: 篝火静静地燃烧着

# uphero.camp.ambience.10
source: 밤이 한 겹 더 깊어졌다
en: Night deepens another layer.
ja: 夜がもう一層深くなった
zh_hans: 夜色又深了一层

# uphero.camp.ambience.11
source: 발자국 소리가 멀어진다
en: Footsteps fade into the distance.
ja: 足音が遠ざかっていく
zh_hans: 脚步声渐渐远去

# uphero.camp.ambience.12
source: 무기의 날을 한 번 갈아둔다
en: A blade gets one careful sharpening.
ja: 武器の刃を一度研いでおく
zh_hans: 把武器的刃磨了一遍

# uphero.camp.ambience.13
source: 오늘의 피로가 천천히 가신다
en: Today's weariness slowly eases.
ja: 今日の疲れがゆっくり引いていく
zh_hans: 今日的疲惫慢慢消散

# uphero.camp.ambience.14
source: 모닥불 그림자가 길게 늘어진다
en: The fire's shadow stretches long.
ja: 焚き火の影が長く伸びる
zh_hans: 篝火的影子被拉得很长

# uphero.camp.ambience.15
source: 여행자의 일기에 한 줄을 적는다
en: A line is added to the traveler's journal.
ja: 旅人の日記に一行書き加える
zh_hans: 在旅人日记里写下一行

# uphero.camp.ambience.2
source: 장작이 탁, 하고 튀었다
en: A log cracks with a sharp snap.
ja: 薪がパチン、と弾けた
zh_hans: 柴火噼啪一声蹦起

# uphero.camp.ambience.3
source: 재 속에서 붉은 숨이 깜빡인다
en: A red breath flickers in the embers.
ja: 灰の中で赤い息が瞬く
zh_hans: 灰烬中闪烁着红色的余温

# uphero.camp.ambience.4
source: 연기가 느리게 하늘로 번진다
en: Smoke drifts slowly into the sky.
ja: 煙がゆっくりと空へ広がる
zh_hans: 烟雾缓缓升向天空

# uphero.camp.ambience.5
source: 불씨 하나가 바람을 따라 올라갔다
en: A spark rides the wind upward.
ja: 火の粉が風に乗って舞い上がった
zh_hans: 一粒火星随风飘起

# uphero.camp.ambience.6
source: 주전자가 나지막이 끓고 있다
en: A kettle hums to a low boil.
ja: 鍋が静かに煮立っている
zh_hans: 锅中汤水咕嘟咕嘟地响

# uphero.camp.ambience.7
source: 지도를 다시 펼쳐본다
en: The map is unfolded once more.
ja: 地図をもう一度広げてみる
zh_hans: 再次展开地图

# uphero.camp.ambience.8
source: 천막 너머로 별이 번진다
en: Stars smear beyond the tent.
ja: 天幕の向こうに星が滲む
zh_hans: 帐篷外星光弥漫

# uphero.camp.ambience.9
source: 바람이 먼 곳에서 불어온다
en: A wind comes from far away.
ja: 遠くから風が吹いてくる
zh_hans: 风从远方吹来

# uphero.combat.abandon
source: 포기
en: Abandon
ja: 撤退
zh_hans: 放弃

# uphero.combat.boss.clearedSuffix
source: (클리어)
en: (cleared)
ja: (撃破)
zh_hans: (已击败)

# uphero.combat.boss.marker
source: F{floor} 보스
en: F{floor} boss
ja: F{floor} ボス
zh_hans: F{floor} 首领

# uphero.combat.choice.fight
source: 싸운다
en: Fight
ja: 戦う
zh_hans: 战斗

# uphero.combat.choice.fleeWithPct
source: 도망간다 ({pct}%)
en: Flee ({pct}%)
ja: 逃げる ({pct}%)
zh_hans: 逃跑 ({pct}%)

# uphero.combat.confirm.keepRewards
source: 지금까지 획득한 보상 (XP · 코인 · 장비) 은 모두 유지됩니다.
en: All rewards earned so far (XP · coins · gear) are kept.
ja: これまでに得た報酬 (XP · コイン · 装備) はすべて保持されます。
zh_hans: 至今获得的奖励 (XP · 金币 · 装备) 都将保留。

# uphero.combat.confirm.missBoss
source: 단, 다음 보스 (F{floor}) 에 도전할 기회를 놓칩니다.
en: You'll miss the chance at the next boss (F{floor}).
ja: ただし、次のボス (F{floor}) に挑戦する機会を失います。
zh_hans: 但将失去挑战下一个首领 (F{floor}) 的机会。

# uphero.combat.confirm.title
source: 탐험을 포기하고 캠프로 돌아갈까요?
en: Abandon expedition and return to camp?
ja: 探索をやめてキャンプに戻りますか？
zh_hans: 放弃探险并返回营地?

# uphero.combat.continue
source: 계속
en: Continue
ja: 続ける
zh_hans: 继续

# uphero.combat.encounter.prompt
source: {monster} 을(를) 만났다.
en: The hero met {monster}.
ja: {monster} に遭遇した。
zh_hans: 遭遇了 {monster}。

# uphero.combat.enemyHp.aria
source: {name} 체력
en: {name} HP
ja: {name} のHP
zh_hans: {name} 生命值

# uphero.combat.expedition
source: 원정
en: Expedition
ja: 遠征
zh_hans: 远征

# uphero.combat.expedition.aria
source: 원정 진행도 — 이번 cycle F{start}~F{end}
en: Expedition progress — this cycle F{start}–F{end}
ja: 遠征進行度 — 今サイクル F{start}~F{end}
zh_hans: 远征进度 — 本周期 F{start}–F{end}

# uphero.combat.expedition.title
source: F{start} → F{end} · 현재 F{current} (? 는 수상한 이벤트)
en: F{start} → F{end} · currently F{current} (? = mystery event)
ja: F{start} → F{end} · 現在 F{current} (? は怪しいイベント)
zh_hans: F{start} → F{end} · 当前 F{current} (? 为神秘事件)

# uphero.combat.expedition.valueText
source: F{start} 에서 F{end} 까지, 현재 F{current}
en: F{start} to F{end}, currently F{current}
ja: F{start} から F{end} まで、現在 F{current}
zh_hans: 从 F{start} 到 F{end},当前 F{current}

# uphero.combat.helpAria
source: 인터랙션 도움말
en: Interaction help
ja: 操作ガイド
zh_hans: 操作帮助

# uphero.combat.hp.aria
source: 영웅 체력
en: Hero HP
ja: 勇者のHP
zh_hans: 英雄生命值

# uphero.combat.hp.danger
source: 위험
en: Danger
ja: 危険
zh_hans: 危险

# uphero.combat.hp.warn
source: 경고
en: Caution
ja: 警告
zh_hans: 警告

# uphero.combat.minigame.fail
source: 도전 실패
en: Challenge failed.
ja: 挑戦失敗
zh_hans: 挑战失败

# uphero.combat.minigame.success
source: 도전 성공
en: Challenge passed.
ja: 挑戦成功
zh_hans: 挑战成功

# uphero.combat.mystery.marker
source: F{floor} — 수상한 이벤트
en: F{floor} — mystery event
ja: F{floor} — 怪しいイベント
zh_hans: F{floor} — 神秘事件

# uphero.combat.narrative.challengeStart
source: 도전이 시작된다...
en: The challenge begins...
ja: 挑戦が始まる...
zh_hans: 挑战开始……

# uphero.combat.narrative.choiceReward
source: 선택의 대가
en: A reward for the choice.
ja: 選択の報酬
zh_hans: 选择的奖励

# uphero.combat.narrative.enemyCrit
source: 치명타! {monster} 이(가) 영웅에게 큰 피해를 입혔다. −{damage}
en: Critical! {monster} dealt heavy damage. −{damage}.
ja: クリティカル!{monster} の渾身の一撃 — {damage} ダメージ
zh_hans: 暴击!{monster} 造成重创 — {damage} 伤害

# uphero.combat.narrative.enemyHit
source: {monster} 이(가) 영웅을 공격한다. −{damage}
en: {monster} struck the hero. −{damage}.
ja: {monster} の攻撃 — {damage} ダメージ
zh_hans: {monster} 攻击勇者 — {damage} 伤害

# uphero.combat.narrative.fleeFail
source: 도망치려 했지만 {monster} 에게 막혔다!
en: Tried to flee, but {monster} cut off the path!
ja: 逃走失敗 — {monster} に阻まれる!
zh_hans: 想要逃跑,却被 {monster} 拦住!

# uphero.combat.narrative.fleeSuccess
source: 영웅이 {monster} 에게서 재빠르게 도망쳤다.
en: The hero slipped away from {monster}.
ja: 勇者は {monster} から逃げ切った!
zh_hans: 勇者迅速地从 {monster} 身边逃脱。

# uphero.combat.narrative.floorArrive
source: {dungeon} — {floor}층에 도착했다.
en: {dungeon} — arrived at Floor {floor}.
ja: {dungeon} — F{floor} に到着。
zh_hans: {dungeon} — 到达 F{floor}。

# uphero.combat.narrative.heroCounter
source: 영웅이 반사적으로 반격한다 — {damage} 피해
en: The hero counter-struck reflexively — {damage} damage.
ja: 勇者の反撃 — {damage} ダメージ
zh_hans: 勇者反击 — {damage} 伤害

# uphero.combat.narrative.heroCrit
source: 치명타! 영웅이 {monster} 의 약점을 꿰뚫는다. −{damage}
en: Critical! The hero pierced {monster}'s weak point. −{damage}.
ja: クリティカル!勇者が {monster} の弱点を突く — {damage} ダメージ
zh_hans: 暴击!勇者命中 {monster} 弱点 — {damage} 伤害

# uphero.combat.narrative.heroDodge
source: 영웅이 회피했다
en: The hero dodged.
ja: 勇者が回避!
zh_hans: 勇者闪避了攻击

# uphero.combat.narrative.heroHit
source: 영웅이 {monster} 를 공격한다. −{damage}
en: The hero struck {monster}. −{damage}.
ja: 勇者の攻撃 — {monster} に {damage} ダメージ
zh_hans: 勇者攻击 {monster} — {damage} 伤害

# uphero.combat.narrative.heroMiss
source: 영웅의 공격이 빗나갔다
en: The hero's attack missed.
ja: 勇者の攻撃は外れた!
zh_hans: 勇者的攻击未命中

# uphero.combat.narrative.monsterDodge
source: {monster} 가 재빠르게 회피했다
en: {monster} nimbly dodged.
ja: {monster} が素早く回避!
zh_hans: {monster} 灵巧地闪开

# uphero.combat.narrative.monsterMiss
source: {monster} 의 공격이 빗나갔다
en: {monster}'s attack missed.
ja: {monster} の攻撃は外れた!
zh_hans: {monster} 的攻击未命中

# uphero.combat.narrative.priestRevive
source: 영웅이 부활한다 — HP +{heal}
en: The hero was revived — HP +{heal}.
ja: 勇者が復活 — HP +{heal}
zh_hans: 勇者复活 — HP +{heal}

# uphero.combat.narrative.restArea
source: {description} — 시간 +{time}
en: {description} — time +{time}.
ja: {description} — 時間 +{time}
zh_hans: {description} — 时间 +{time}

# uphero.combat.narrative.revealBoss
source: 보스의 기운이 느껴진다.
en: A boss's presence can be felt.
ja: ボスの気配を感じる。
zh_hans: 感受到了首领的气息。

# uphero.combat.narrative.skillHitMonster.druid_wild_call_t4
source: 야생의 짐승이 {monster} 을 공격한다 — {damage} 피해
en: A wild beast mauled {monster} — {damage} damage.
ja: 野生の獣が {monster} を襲う — {damage} ダメージ
zh_hans: 野兽袭击 {monster} — {damage} 伤害

# uphero.combat.narrative.skillHitMonster.mage_fireball_t3
source: 불꽃이 {monster} 을 휩싼다 — {damage} 피해
en: Flames engulfed {monster} — {damage} damage.
ja: 炎が {monster} を包む — {damage} ダメージ
zh_hans: 烈焰包裹 {monster} — {damage} 伤害

# uphero.combat.narrative.skillHitMonster.mage_lightning_t1
source: 영웅의 번개가 {monster} 을 꿰뚫는다 — {damage} 피해
en: The hero's lightning pierced {monster} — {damage} damage.
ja: 勇者の雷が {monster} を貫く — {damage} ダメージ
zh_hans: 勇者的雷电贯穿 {monster} — {damage} 伤害

# uphero.combat.narrative.skillHitMonster.mage_meteor_t4
source: 메테오가 {monster} 을 내리친다 — {damage} 피해
en: A meteor crashed down on {monster} — {damage} damage.
ja: メテオが {monster} に降り注ぐ — {damage} ダメージ
zh_hans: 陨石砸向 {monster} — {damage} 伤害

# uphero.combat.narrative.skillHitMonster.monk_flash_t2
source: 일섬 — {monster} 을 베어낸다 — {damage} 피해
en: Flash Strike sliced {monster} — {damage} damage.
ja: 一閃 — {monster} を斬り裂く — {damage} ダメージ
zh_hans: 一闪 — 斩裂 {monster} — {damage} 伤害

# uphero.combat.narrative.skillHitMonster.priest_judgment_t3
source: 심판 — {monster} 이 빛에 타들어간다 — {damage} 피해
en: Judgment — {monster} burned in the light — {damage} damage.
ja: 審判 — {monster} が光に焼かれる — {damage} ダメージ
zh_hans: 审判 — {monster} 在光中燃烧 — {damage} 伤害

# uphero.combat.narrative.skillHitMonster.warrior_crush_t3
source: 분쇄가 {monster} 을 강타한다 — {damage} 피해
en: Crush smashed {monster} — {damage} damage.
ja: 粉砕が {monster} を打ちのめす — {damage} ダメージ
zh_hans: 粉碎重击 {monster} — {damage} 伤害

# uphero.combat.narrative.skillHitMonster.warrior_rage_burst_t4
source: 영웅이 분노를 폭발시킨다 — {monster} 에 {damage} 고정 피해
en: The hero unleashed rage — {damage} fixed damage to {monster}.
ja: 勇者が怒りを爆発させる — {monster} に {damage} 固定ダメージ
zh_hans: 勇者释放怒火 — 对 {monster} 造成 {damage} 固定伤害

# uphero.combat.narrative.skipBlocked
source: 통로가 보스의 문 앞에서 끊겨 있다
en: The passage ends right before the boss's door
ja: 通路はボスの扉の手前で途切れている
zh_hans: 通道在魔王之门前中断了

# uphero.combat.pause
source: 일시정지
en: Pause
ja: 一時停止
zh_hans: 暂停

# uphero.combat.resume
source: 재개
en: Resume
ja: 再開
zh_hans: 继续

# uphero.combat.speed
source: 속도
en: Speed
ja: 速度
zh_hans: 速度

# uphero.combat.time.aria
source: 탐험 시간
en: Expedition time
ja: 探索時間
zh_hans: 探险时间

# uphero.combat.time.danger
source: 시간 위험
en: Time critical
ja: 時間危険
zh_hans: 时间紧急

# uphero.combat.time.warn
source: 시간 경고
en: Time low
ja: 時間警告
zh_hans: 时间不足
